ci4_telefonia/app/Controllers/ClientesController.php

SELECT *
FROM `clientes`
---
    public function index(): string
    {
        $clientes = new ClientesModel();
        $datos['datos'] = $clientes->findAll();

INSERT INTO `clientes` (`cliente_id`, `apellido`, `nombre`, `correo_electronico`, `calle_avenida`, `no_casa`, `zona`) VALUES ('1', 'prueba', 'pruebnas1', 'bjaksbd', 'khbsahkb', '25', '2')
---
    public function agregarCliente()
    {
        $datos = [
            'cliente_id' => $this->request->getVar('txtId'),
            'apellido' => $this->request->getVar('txtApellido'),
            'nombre' => $this->request->getVar('txtNombre'),
            'correo_electronico' => $this->request->getVar('txtCorreoElectronico'),
            'calle_avenida' => $this->request->getVar('txtCalleAvenida'),
            'no_casa' => $this->request->getVar('txtNumeroCasa'),
            'zona' => $this->request->getVar('txtZona')
        ];
        $clientes = new ClientesModel();
        $clientes->insert($datos);

DELETE FROM `clientes`
WHERE `cliente_id` IN ('2')
---
    public function eliminarCliente($id=null)
    {
        //echo $id;
        $clientes = new ClientesModel();
        $clientes->delete(['cliente_id'=>$id]);

SELECT *
FROM `clientes`
WHERE `cliente_id` = '6'
 LIMIT 1
---
    public function buscarCliente($id=null)
    {
        $clientes = new ClientesModel();
        $datos['datos'] = $clientes->where('cliente_id', $id)->first();