ci4_telefonia/app/Controllers/LineasTelefonicasController.php

    public function index(): string
    {
        $lineas_Telefonicas = new LineasTelefonicasModel();
        $datos['datos'] = $lineas_Telefonicas->findAll();
---
SELECT *
FROM `lineas_telefonicas`