ci4_telefonia/app/Controllers/PlanesController.php

SELECT *
FROM `planes`
---
    public function index(): string
    {
        $planes = new PlanesModel();
        $datos['datos'] = $planes->findAll();